# -*- coding: utf-8 -*
# Вычислите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.

import math
print(math.sqrt(179 ** 2 + 971 ** 2))