# -*- coding: utf-8 -*
# Даны три целых числа. Найдите наибольшее из них (программа должна вывести ровно одно целое число).
# Какое наименьшее число операторов сравнения (>, <, >=, <=) необходимо для решения этой задачи?

# Входные данные
# Вводится три целых числа.

# Выходные данные
# Выведите ответ на задачу.

a = int(input());
b = int(input());
c = int(input());

print(max(a, b, c))