# -*- coding: utf-8 -*
# Даны два целых числа. Выведите значение наибольшего из них.

# Входные данные
# Вводятся два числа.

# Выходные данные
# Выведите ответ на задачу.

a = int(input())
b = int(input())
print(max(a, b))