# -*- coding: utf-8 -*
# По данному целому неотрицательному n вычислите значение n!.

# Входные данные
# Вводится число n.

# Выходные данные
# Выведите ответ на задачу.

import math
number = int(input())
print(math.factorial(number))