# -*- coding: utf-8 -*
# Дана строка. Удалите из этой строки все символы @.

# Входные данные
# Вводится строка.

# Выходные данные
# Выведите ответ на задачу.

input_string = input();
print(input_string.replace("@", ""))

